# Функція для головного виконання програми
def main():
    # Запитуємо користувача про символ для заповнення та кількість рядків та стовпців
    symbol = input("Введіть символ для заповнення: ")
    N = int(input("Введіть кількість рядків та стовпців: "))

    # Обробка негативного значення N
    if N < 0:
        N *= -1
    # Обробка нульового значення N
    elif N == 0:
        print("Некоректне значення для N")
        return
    # Обробка непарного значення N
    if N % 2 != 0:
        N += 1
        print(f"Ваше число було непарним, тому тепер воно становить: {N}")

    print(f"\nВаш символ для заповнення: {symbol}\n")

    # Перевірка, чи введено лише один символ
    if len(symbol) > 1:
        print("Ви ввели занадто багато символів")
        return

    # Створюємо порожній зубчастий список
    matrix = []

    # Заповнюємо зубчастий список рядками символів для першого трикутника
    for i in range(N // 2):
        row = [symbol] * (i + 1)
        matrix.append(row)

    # Заповнюємо зубчастий список рядками символів для другого трикутника
    for i in range(N // 2, N):
        row = [""] * (N // 2) + [symbol] * (i - N // 2 + 1)
        matrix.append(row)

    # Виводимо зубчастий список на екран та записуємо у файл
    with open("Lab1.txt", "w") as fout:
        for row in matrix:
            print("\t".join(row))
            fout.write("\t".join(row) + "\n")

# Викликаємо головну функцію при запуску програми
if __name__ == "__main__":
    main()
